<template>
    <div class="cart-conteiner">
        <div class="mbox">
            <form @submit.prevent="submitForm()" class="conteiner-form">
                <div class="head-text"> Заповніть форму доставки </div>
                <div class="inputer">
                    <input type="text" name="name" placeholder="Ім'я"
                        v-model="name"
                        :class="{error : validation.name }"
                    >
                </div>
                <div class="inputer">
                    <input type="tel" name="tel" placeholder="Телефон"
                        v-model="tel"
                        :class="{error : validation.tel }"
                    >
                </div>
                <div class="inputer">
                    <input type="text" name="adress" placeholder="Адреса"
                        v-model="adress"
                        :class="{error : validation.adress }"
                    >
                </div>
                <div class="checker">
                    <div class="beutify" 
                        :class="{checked : checkedPop}"
                        @click="changeCheck()"
                    ></div>
                    <div class="texter"
                        @click="openPopup()"
                    >Погоджуюсь з правилами продажу</div>
                </div>
                <div class="submiter">
                    <button class="butt"> Відправити </button>
                </div>
            </form>
        </div>
        <div class="popup-contein" :class="{open : popup }">
            <div class="contein">
                <div class="closer" @click="closePopup()">
                    <span></span>
                    <span></span>
                </div>
                <div class="texter">
                    <h2>Правила продажу</h2>
                    <h3>Договір публічної оферти.</h3>
                    <p>Договір публічної оферти є публічним, тобто відповідно до статті 633 Цивільного кодексу України його умови однакові для всіх покупців незалежно від статусу (фізична особа, юридична особа, фізична особа - підприємець). При повній згоді з даним Договором, покупець приймає умови та порядок оформлення замовлення, оплати товару, доставки товару і за невиконання умов даного договору.</p>
                    <p>Цей текст є угодою між сайтом доставки if.rotata.pizza, додатком Rotata Pizza розміщеним в AppStore та Google Play, іменованим надалі  "сайт-доставки", і будь-якою юридичною або фізичною особою,  користувачем послуг сайту-доставки, яка надалі іменується "Покупець" і визначає умови придбання товарів через сайт-даставки.</p>
                    <p>Ця угода має характер публічної оферти, є еквівалентом "усної угоди" і відповідно до чинного законодавства України має належну юридичну силу.</p>
                    <br />
                    <h4>1. Загальні положення</h4>
                    <p>1.1. Цей договір є публічною офертою (відповідно до ст.ст. 633, 641 і гл. 63 Цивільного кодексу України), має відповідну юридичну силу та містить всі істотні умови організації купівлі-продажу дистанційним способом, тобто через сайт-доставки або додаток.</p>
                    <p>1.2. У відповідності до ст. 642 Цивільного Кодексу України повним і безсуперечним прийняттям умов публічного договору, тобто публічної оферти сайт-доставки є факт оформлення замовлення натисканням на посилання "Оформити замовлення" в кошику та оплати замовлення в розмірі 100% на умовах цієї угоди після доставки замовлення. </p>
                    <p>1.3. Даний Договір набуває чинності з моменту натискання на кнопку “ОФОРМИТИ ЗАМОВЛЕННЯ”, яким Покупець надає згоду здійснити покупку наявного у Продавця Товару та діє до моменту отримання Покупцем Товару від Продавця і повного розрахунку з ним.</p>
                    <p>1.4. Укладаючи Договір, Покупець підтверджує, що цілком і повністю ознайомлений та згоден з його умовами, а також, у разі, якщо Покупець є фізичною особою, дає дозвіл на обробку своїх персональних даних з метою можливості виконання умов цього Договору, можливості проведення взаєморозрахунків, а також для отримання рахунків, актів та інших документів. Дозвіл на обробку персональних даних діє протягом усього строку дії Договору. Крім цього, укладанням цього Договору, Покупець підтверджує, що йому повідомлено (без додаткового повідомлення) про права, встановлені Законом України «Про захист персональних даних», про цілі збору даних. Обсяг прав Покупця, як суб'єкта персональних даних відповідно до Закону України «Про захист персональних даних», йому відомий і зрозумілий.</p>
                    <p>1.5. Оформивши замовлення на покупку товару, Покупець тим самим автоматично дає згоду на отримання інформації шляхом електронних повідомлень про товари та послуги з сайту-доставки. Покупець має право відмовитись від отримання таких повідомлень, повідомивши сайт-доставки шляхом телефонного зв’язку.</p>
                    <br />
                    <h4> 2. Терміни та визначення</h4>
                    <p>2.1. «Оферта» — публічна пропозиція Продавця, адресована будь-якій фізичній та юридичній особі з метою укласти договір куплі-продажу на наявних умовах, зазначених у Договорі.</p>
                    <p>2.2. «Товар» — перелік найменувань асортименту, представлений на офіційному сайті-доставки та додатку Rotata Pizza.</p>
                    <p>2.3. «Продавець» — компанія, що реалізує Товар, представлений в інтернет-магазині, але не обмежений тільки сайтом та додатком.</p>
                    <p>2.4. «Покупець» — фізична або юридична особа, що вступила в договірні відносини з Продавцем на умовах, зазначених у Договорі.</p>
                    <p>2.5. «Персональні дані» – будь-яка інформація, яка прямо чи опосередковано відноситься до певної особи, чи до особи, яка визначається.</p>
                    <p>2.6. «Акцепт» — повне та беззаперечне прийняття Покупцем умов Договору</p>
                    <p>2.7. «Оформити замовлення» - рішення Покупця придбати товар, оформлене на сайті чи додатку.</p>
                    <p>2.8. «Кур’єрська доставка» — безпосередня передача Товару від Продавця до Покупця незалежним підрядником,  який надає послуги Продавцю відповідно до окремого укладеного договору. Продавець не здійснює самостійно доставку Товару. </p>
                    <p>2.9. «Інтернет-магазин» — веб-сторінка Продавця <a href="http://if.rotata.pizza/" target="_blank">http://if.rotata.pizza/</a> та додаток Rotata Pizza</p>
                    <p>2.10. «Місце продажу Товару» — заклад громадського харчування (ресторан) Продавця. </p>
                    <br />
                    <h4>3. Предмет договору</h4>
                    <p>3.1. Сайт-доставки зобов'язується передати у власність Покупцеві товар, а Покупець зобов'язується оплатити та прийняти товар на умовах Цього договору.</p>
                    <p>3.2. Даний договір є офіційним документом Продавця та невід’ємною частиною Оферти.</p>
                    <p>3.3. Цей договір регулює купівлю-продаж на сайті-доставки чи додатку, в тому числі: <br />
                    а) добровільний вибір Покупцем товарів; <br />
                    б) самостійне оформлення Покупцем замовлення на сайті-доставки чи додатку; <br />
                    в) оплата Покупцем замовлення, оформленого на сайті-доставки чи додатку; <br />
                    г) виконання і передача замовлення Покупцеві у власність на умовах Цього договору.</p>
                    <br />
                    <h4>4. Порядок оформлення замовлення</h4>
                    <p>4.1. Моментом вступу Покупця в договірні відносини з Продавцем вважається момент замовлення Товару, незалежно від способу замовлення та форми оплати.</p>
                    <p>4.2. Покупець самостійно оформляє замовлення на сайті-доставки чи додатку.</p>
                    <br />
                    <h4> 5. Вартість і порядок оплати замовлення</h4>
                    <p>5.1. Повна вартість замовлення складається з вартості товару (зазначеної на сайті) та вартості доставки.</p>
                    <p>5.2. Ціни в інтернет-магазині вказані в національній валюті України (гривня) за одиницю товару відповідно до наявного прейскуранта.</p>
                    <p>5.3. Продавець залишає за собою право змінювати ціну Товару до моменту оформлення замовлення без попередження Покупця. </p>
                    <p>5.4. Остаточною є ціна, вказана менеджером під час оформлення замовлення. </p>
                    <p>5.5. Покупець оплачує замовлення будь-яким способом, обраним на сайті-доставки чи додатку, або безготівковим (шляхом перерахування коштів на рахунок сайта-доставки), або готівковим – шляхом передачі грошових коштів безпосередньо кур’єру під час доставки замовленого товару</p>
                    <p>5.6. При безготівковій формі розрахунку Покупець зобов’язаний пред’явити менеджеру або кур’єру документ, що підтверджує факт оплати Товару (платіжне доручення, квитанція про сплату тощо).</p>
                    <br />
                    <h4>  6. Доставка замовлення</h4>
                    <p>6.1. Покупець має право отримати замовлений ним Товар за допомогою самостійного вивозу (самовивіз) із закладу громадського харчування (ресторану) Продавця або скористатися послугами кур’єрської доставки. </p>
                    <p>6.2. Самовивіз здійснюється Покупцем із закладу громадського харчування (ресторану) Продавця, зазначеного в замовленні.</p>
                    <p>6.3. Кур’єрська доставка замовлення Покупцю здійснюється за погодженням із Покупцем і за вказаною ним адресою.</p>
                    <p>6.4. Доставка замовленого Товару здійснюється в межах м. Івано-Франківськ,  якщо інше не передбачено попередньою домовленістю між сторонами.</p>
                    <br />
                    <h4> 7. Порядок повернення товару</h4>
                    <p>7.1. Покупець має право відмовитися від отриманого товару не належної якості після його огляду в момент прийняття товару.</p>
                    <p>7.2. В разі відмови від товару неналежної якості, вартість якого була сплачена Покупцем шляхом безготівкового розрахунку, сайт-доставки, додаток повертає кошти Покупцеві за товар неналежної якості протягом 10 банківських днів.</p>
                    <br />
                    <h4> 8. Права та обов'язки сторін</h4>
                    <p>
                        8.1. Продавець зобов'язується: <br />
                        а) Не розголошувати будь-яку приватну інформацію Покупця і не надавати доступ до цієї інформації третім особам, за винятком випадків, передбачених чинним законодавством України.<br />
                        б) Надати Покупцю можливість отримання безкоштовних телефонних консультацій за телефонами, вказаними на сайті ( <a href="http://if.rotata.pizza/" target="_blank"> http://if.rotata.pizza/</a>) чи додатку. Обсяг консультацій обмежується конкретними питаннями, пов’язаними з виконанням замовлення.<br />
                        в) Продавець залишає за собою право невиконання замовлення в разі виникнення форс-мажорних обставин.<br />
                        г) Продавець залишає за собою право змінювати даний Договір в односторонньому порядку до моменту його укладання.
                    </p>
                    <p>8.2. Покупець зобов'язаний: <br />
                        а) До моменту звернення в інтернет-магазин <a href="http://if.rotata.pizza/" target="_blank"> http://if.rotata.pizza/</a> чи додатку ознайомитися зі змістом Договору-оферти, умовами оплати та доставки на сайті магазину, самостійно оформити замовлення на сайті-доставки чи додаток;
                        б) своєчасно оплатити та отримати замовлення у Перевізника на умовах цього договору;<br />
                        в) Право власності на Замовлення, а також ризик його випадкового пошкодження чи втрати переходять до Покупця з моменту передачі Товару.
                    </p>
                    <br />
                    <h4>9. Термін дії цього договору</h4>
                    <p>9.1. Цей договір набирає чинності з дня оформлення замовлення і діє до виконання всіх умов договору.</p>
                    <br />
                    <h4>10. Інформація та її використання.</h4>
                    <p>10.1. Покупець зобов’язаний надати точну і правдиву інформацію в обсязі, необхідному для надання послуг та / або купівлі товару, які він отримує або купує. Інформація, надана покупцем, за необхідності може бути опублікована у відкритих джерелах.</p>
                    <p>10.2. Інтернет-магазин http://if.rotata.pizza/ та додаток має право на власний розсуд вимагати від Покупця документального підтвердження автентичності наданої інформації.</p>
                    <p>10.3. Продавець збирає та опрацьовує персональні дані Покупців (а саме: прізвище, ім’я, по батькові Покупця; адреса доставки; контактні телефони, адреса електронної пошти тощо) з метою: <br />
                        - виконання умов даного Договору;<br />
                        - доставки Покупцю замовленої ним продукції.
                    </p>
                    <p>10.4. Здійснюючи Замовлення Товару через інтернет-магазин http://if.rotata.pizza/ чи додаток, Покупець дає згоду на збір та опрацювання такої інформації.</p>
                    <p>10.5. Доступ до персональних даних Покупця мають лише особи, які безпосередньо залучені до виконання Замовлення.</p>
                    <p>10.6. Продавець зобов’язується: дотримуватися конфіденційності стосовно персональних даних Покупців; не допускати спроби несанкціонованого використання персональних даних Покупців третіми особами; виключити доступ до персональних даних Покупців осіб, що не мають безпосереднього відношення до виконання Замовлення, окрім випадків, передбачених чинним законодавством України.</p>
                </div>
            </div>
        </div>
    </div>

</template>

<script>

    /* test funk */
        var emailRE = /^(([^<>()[\]\\.,;:\s@\"]+(\.[^<>()[\]\\.,;:\s@\"]+)*)|(\".+\"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/ ;

        function isEmpty( el ) {
            if ( el != '' ){
                return false;
            } else {
                return true;
            }
        }

        function passDiff( elOrigin, elConfirm ) {
            if ( elOrigin != elConfirm  ){
                return true;
            } else {
                return false;
            }
        }
    /* test funk */

    export default {
        name: 'Form',
        data (){
            return{
                adress : '',
                tel : '',
                name : '',
                popup: false, 
                checkedPop : false
            }
        },
        created: function() {

            return this.$store.dispatch('loadCartList');

        },
        computed : {
            listItems(){
                return this.$store.state.addedCartList
            },

            calculateSumm(){
                let summ = 0;
                this.listItems.forEach( ( item ) => {
                    /*console.log( item.type );
                    if ( item.type == 1 ){*/
                        summ+= item.price * item.count;
                   // }
                });
                return summ;
            },

            validation (){
                return {
					adress : isEmpty( this.adress ),
                    tel: isEmpty( this.tel ),
                    name : isEmpty( this.name ),
                    checkedPop : !this.checkedPop
				}
            },
            valid : function(){
				let val = this.validation;
				let stek = true ;
				Object.keys( val ).forEach(function (key) {
					stek = ( !val[key] && stek ) ? true : false ;
                });
				return stek;		
            }
        },
        methods: {
            closePopup(){
                this.popup = !this.popup;
            },
            openPopup(){
                this.popup = !this.popup;
            },
            submitForm(){
                if( this.valid ){
                    
                    this.$store.dispatch('sendMail', {
                        mail : this.adress,
                        tel : this.tel,
                        name : this.name,
                        stack : this.listItems
                    }).then( () => {
                        
                        this.$router.replace('/ty');
                        
                    });
                }
            },

            changeCheck(){
                this.checkedPop = !this.checkedPop;
            }

        }
    }

</script>

<style lang="scss" scoped>
    .cart-conteiner{padding: 50px 0;}
    .conteiner-form{
        .head-text{text-align: center; font-size: 24px; margin-bottom: 20px; }
        .inputer, .submiter{max-width: 360px; margin: 0 auto 15px;
            input{width: 100%; height: 48px; border: 1px solid #ccc; outline: none; font-size: 16px;padding: 0 10px; color: #454545;
                &.error{ border-color: crimson; }
            }
            .butt{width: 100%; outline: none; font-size: 16px; border: none;}
        }
        .checker{max-width: 360px; margin: 0 auto 15px; display: flex; align-items: center; justify-content: flex-start; 
            .beutify{width: 22px; height: 22px; border-radius: 4px; border: 2px solid #51291c; position: relative; margin-right: 10px; cursor: pointer;
                &:before{content: ''; transition: all 0.3s; position: absolute; width: 8px; height: 20px; border-bottom: 3px solid #f35d21; border-right: 3px solid #f35d21; transform: rotate(45deg); left: 8px; top: -8px; opacity: 0;}
                &.checked:before{ opacity: 1;}
            }
            .texter{text-decoration: underline; color: #51291c; font-size: 18px; cursor: pointer;}
        }
    }
    .popup-contein{ position: fixed; z-index: 100; left: 0; right: 0; bottom: 0; top: 0; width: 100vw; height: 100vh; overflow: hidden; padding: 20px; background-color: rgba(0,0,0, 0.8); display: none;
        &.open{ display: block;}
        .closer{ position: absolute; top: 15px; cursor: pointer; right: 15px; width: 40px; height: 40px; border: 2px solid red; 
            span{width: 28px; height: 2px; background-color: red; position: absolute; top: calc(50% - 1px); left: calc(50% - 14px);
                &:nth-child(1){transform: rotate(45deg); }
                &:nth-child(2){transform: rotate(-45deg); }
            }
        }
        .texter{ width: 100%; height: auto; 
            h1, h2, h3, h4{text-align: center;}
        }
        .contein{ width: calc(100vw - 40px); height: calc(100vh - 40px); overflow: auto; background-color: #fff; max-width: 1024px; margin: 0 auto; padding: 15px; position: relative; z-index: 5;}
    }
</style>
